app/controllers/area_products_controller.rb

SELECT * FROM "area_products"
---
  def index
    @area_products = AreaProduct.all

SELECT * FROM "area_products" WHERE ("area_products"."id" = 1)
---
  def show
    @area_product = AreaProduct.find(params[:id])

SELECT * FROM "area_products" WHERE ("area_products"."id" = 1)
---
  def edit
    @area_product = AreaProduct.find(params[:id])

SELECT * FROM "area_products" WHERE ("area_products"."id" = 1)
UPDATE "area_products" SET "updated_at" = '2009-09-25 01:36:19', "width" = 55.0 WHERE "id" = 1
---
  def update
    @area_product = AreaProduct.find(params[:id])

    respond_to do |format|
      if @area_product.update_attributes(params[:area_product])