app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT * FROM `locations`

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO `locations` (`name`, `address`, `position`, `contact_number`, `created_at`, `country`, `post_code`, `notes`, `updated_at`, `suburb`, `primary_contact`, `website`, `state`) VALUES('Rundle Street Market', 'Rundle Street', '', '', '2009-09-11 03:04:21', 'Australia', '5000', 'Sunday Market. $90 per week. $50 with own Marquee. Main regular outdoor market in Adelaide.', '2009-09-11 03:04:21', 'Adelaide', '', '', 'SA')

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
UPDATE `locations` SET `updated_at` = '2009-09-11 02:04:31', `notes` = 'Weekly. Most prestigious markets in Australia. We have negotiated free stall hire', `name` = 'Paddington Markets', `website` = 'www.paddingtonmarkets.com.au' WHERE `id` = 2