app/controllers/product_types_controller.rb

SELECT * FROM "product_types"
---
  def index
    @product_types = ProductType.all

SELECT * FROM "product_types" WHERE ("product_types"."id" = 1)
---
  def show
    @product_type = ProductType.find(params[:id])

INSERT INTO "product_types" ("name", "created_at", "updated_at", "first_production") VALUES('Rug', '2009-09-20 00:28:51', '2009-09-20 00:28:51', '2009-09-20')
---
  def create
    @product_type = ProductType.new(params[:product_type])

    respond_to do |format|
      if @product_type.save