app/controllers/products_controller.rb

SELECT * FROM "area_products" WHERE ("area_products".product_id = 3)
SELECT * FROM "products" WHERE ("products"."id" = 3)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "area_products" ("created_at", "product_id", "shape", "updated_at", "area", "length", "perimeter", "width") VALUES('2009-09-25 01:28:32', 3, '1.2', '2009-09-25 01:28:32', 3.0, 1.7, 4.0, NULL)
INSERT INTO "products" ("name", "created_at", "code", "updated_at", "ceased_production", "product_type_id", "first_production") VALUES('rugs', '2009-09-21 06:46:47', 'das', '2009-09-21 06:46:47', '2009-09-21', NULL, '2009-09-21')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "area_products" WHERE ("area_products".product_id = 5)
SELECT * FROM "products" WHERE ("products"."id" = 2)
UPDATE "area_products" SET "updated_at" = '2009-09-25 01:54:18', "width" = 3.0 WHERE "id" = 3
UPDATE "products" SET "ceased_production" = '2009-09-25', "updated_at" = '2009-09-25 01:43:49', "name" = 'Bath Mat', "first_production" = '2009-09-25', "code" = '' WHERE "id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])