app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT * FROM "states"

  def show
    @state = State.find(params[:id])
---
SELECT * FROM "states" WHERE ("states"."id" = 1)

  def create
    @state = State.new(params[:state])

    respond_to do |format|
      if @state.save
---
INSERT INTO "states" ("name", "created_at", "code", "country", "updated_at") VALUES('South Australia', '2009-09-18 01:54:31', 'SA', 'Australia', '2009-09-18 01:54:31')