app/controllers/volunteers_controller.rb

SELECT * FROM `volunteers`
---
  def index
    @volunteers = Volunteer.all

SELECT * FROM `volunteers` WHERE (`volunteers`.`id` = 1)
---
  def show
    @volunteer = Volunteer.find(params[:id])

SELECT * FROM `volunteers` WHERE (`volunteers`.`id` = 1)
---
  def edit
    @volunteer = Volunteer.find(params[:id])

INSERT INTO "volunteers" ("work_phone", "region", "business_name", "personal_skills", "created_at", "skype_name", "paid", "updated_at", "payment_method", "birth_date", "home_phone", "mobile", "preffered_name", "surname", "entered_by", "given_names", "email", "processed_by", "payment_notes") VALUES('08 8227 1388', 'SA', 'Alec Khoo & Associates', 'IT', '2009-09-13 07:17:59', 'richkhoo22', 't', '2009-09-13 07:17:59', 'CASH', '1996-09-13', '08 8370 1468', '0425 614 388', 'Richie', 'Khoo', 'Richie', 'Richard', 'richardkhoo@carpetsforcommunities.org', 'Richie', '')
---
  def create
    @volunteer = Volunteer.new(params[:volunteer])

    respond_to do |format|
      if @volunteer.save

SELECT * FROM `volunteers` WHERE (`volunteers`.`id` = 3)
UPDATE `volunteers` SET `updated_at` = '2009-09-04 02:01:43', `email` = 'richardkhoo@carpetsforcommunities.org', `birth_date` = '2004-08-21' WHERE `id` = 1
---
  def update
    @volunteer = Volunteer.find(params[:id])

    respond_to do |format|
      if @volunteer.update_attributes(params[:volunteer])

SELECT * FROM `volunteers` WHERE (`volunteers`.`id` = 2)
DELETE FROM `volunteers` WHERE `id` = 2
---
  def destroy
    @volunteer = Volunteer.find(params[:id])
    @volunteer.destroy